Autodesk.Revit.DB.ColorDepthType
An enumerated type listing all Color Depth types of Print Setting.

Autodesk.Revit.DB.ColorDepthType.Color
The type of Color Depth is Color.

Autodesk.Revit.DB.ColorDepthType.GrayScale
The type of Color Depth is Gray Scale.

Autodesk.Revit.DB.ColorDepthType.BlackLine
The type of Color Depth is Black Line.